app/controllers/users_controller.rb

INSERT INTO "users" ("fname", "lname", "username", "birthday", "phone_number", "outside_email", "pass_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if user_params[:pass] != params[:other_pass]
      flash.now[:error] = ["Your passwords didn't match."]
      render :new
    else

      if @user.save